mikeakohn/naken_asm/include/dspic/p33ck64mc105.inc
; Convert Microchip include files to naken_asm readable.
_iwri1 equ 0x801028
_iwri2 equ 0x80102C
__FSEC equ 0xAF00
__FBSLIM equ 0xAF10
__FOSCSEL equ 0xAF18
__FOSC equ 0xAF1C
__FWDT equ 0xAF20
__FPOR equ 0xAF24
__FICD equ 0xAF28
__FDMTIVTL equ 0xAF2C
__FDMTIVTH equ 0xAF30
__FDMTCNTL equ 0xAF34
__FDMTCNTH equ 0xAF38
__FDMT equ 0xAF3C
__FDEVOPT equ 0xAF40
__FALTREG equ 0xAF44
__NO_HANDLES equ 1;          /* Suppress handles on this device  */
__CODE_BASE equ 0x200
__CODE_LENGTH equ 0xAD00
__IVT_BASE  equ 0x4
__DATA_BASE equ 0x1000
__DATA_LENGTH equ 0x2000
__YDATA_BASE equ 0x2000
__YDATA_END equ 0x3000
_WREG0        equ 0x0
WREG1        equ 0x2
_WREG1        equ 0x2
WREG2        equ 0x4
_WREG2        equ 0x4
WREG3        equ 0x6
_WREG3        equ 0x6
WREG4        equ 0x8
_WREG4        equ 0x8
WREG5        equ 0xA
_WREG5        equ 0xA
WREG6        equ 0xC
_WREG6        equ 0xC
WREG7        equ 0xE
_WREG7        equ 0xE
WREG8        equ 0x10
_WREG8        equ 0x10
WREG9        equ 0x12
_WREG9        equ 0x12
WREG10       equ 0x14
_WREG10       equ 0x14
WREG11       equ 0x16
_WREG11       equ 0x16
WREG12       equ 0x18
_WREG12       equ 0x18
WREG13       equ 0x1A
_WREG13       equ 0x1A
WREG14       equ 0x1C
_WREG14       equ 0x1C
WREG15       equ 0x1E
_WREG15       equ 0x1E
SPLIM        equ 0x20
_SPLIM        equ 0x20
ACCAL        equ 0x22
_ACCAL        equ 0x22
ACCAH        equ 0x24
_ACCAH        equ 0x24
ACCAU        equ 0x26
_ACCAU        equ 0x26
ACCBL        equ 0x28
_ACCBL        equ 0x28
ACCBH        equ 0x2A
_ACCBH        equ 0x2A
ACCBU        equ 0x2C
_ACCBU        equ 0x2C
PCL          equ 0x2E
_PCL          equ 0x2E
PCH          equ 0x30
_PCH          equ 0x30
DSRPAG       equ 0x32
_DSRPAG       equ 0x32
_DSRPAGbits   equ 0x32
DSWPAG       equ 0x34
_DSWPAG       equ 0x34
_DSWPAGbits   equ 0x34
RCOUNT       equ 0x36
_RCOUNT       equ 0x36
DCOUNT       equ 0x38
_DCOUNT       equ 0x38
DOSTARTL     equ 0x3A
_DOSTARTL     equ 0x3A
DOSTARTH     equ 0x3C
_DOSTARTH     equ 0x3C
DOENDL       equ 0x3E
_DOENDL       equ 0x3E
DOENDH       equ 0x40
_DOENDH       equ 0x40
SR           equ 0x42
_SR           equ 0x42
_SRbits       equ 0x42
CORCON       equ 0x44
_CORCON       equ 0x44
_CORCONbits   equ 0x44
MODCON       equ 0x46
_MODCON       equ 0x46
_MODCONbits   equ 0x46
XMODSRT      equ 0x48
_XMODSRT      equ 0x48
XMODEND      equ 0x4A
_XMODEND      equ 0x4A
YMODSRT      equ 0x4C
_YMODSRT      equ 0x4C
YMODEND      equ 0x4E
_YMODEND      equ 0x4E
XBREV        equ 0x50
_XBREV        equ 0x50
_XBREVbits    equ 0x50
DISICNT      equ 0x52
_DISICNT      equ 0x52
TBLPAG       equ 0x54
_TBLPAG       equ 0x54
_TBLPAGbits   equ 0x54
YPAG         equ 0x56
_YPAG         equ 0x56
_YPAGbits     equ 0x56
MSTRPR       equ 0x58
_MSTRPR       equ 0x58
_MSTRPRbits   equ 0x58
CTXTSTAT     equ 0x5A
_CTXTSTAT     equ 0x5A
_CTXTSTATbits equ 0x5A
DMTCON       equ 0x5C
_DMTCON       equ 0x5C
_DMTCONbits   equ 0x5C
DMTPRECLR    equ 0x60
_DMTPRECLR    equ 0x60
_DMTPRECLRbits equ 0x60
DMTCLR       equ 0x64
_DMTCLR       equ 0x64
_DMTCLRbits   equ 0x64
DMTSTAT      equ 0x68
_DMTSTAT      equ 0x68
_DMTSTATbits  equ 0x68
DMTCNTL      equ 0x6C
_DMTCNTL      equ 0x6C
DMTCNTH      equ 0x6E
_DMTCNTH      equ 0x6E
DMTHOLDREG   equ 0x70
_DMTHOLDREG   equ 0x70
DMTPSCNTL    equ 0x74
_DMTPSCNTL    equ 0x74
DMTPSCNTH    equ 0x76
_DMTPSCNTH    equ 0x76
DMTPSINTVL   equ 0x78
_DMTPSINTVL   equ 0x78
DMTPSINTVH   equ 0x7A
_DMTPSINTVH   equ 0x7A
SENT1CON1    equ 0x80
_SENT1CON1    equ 0x80
_SENT1CON1bits equ 0x80
SENT1CON2    equ 0x84
_SENT1CON2    equ 0x84
SENT1CON3    equ 0x88
_SENT1CON3    equ 0x88
SENT1STAT    equ 0x8C
_SENT1STAT    equ 0x8C
_SENT1STATbits equ 0x8C
SENT1SYNC    equ 0x90
_SENT1SYNC    equ 0x90
SENT1DATL    equ 0x94
_SENT1DATL    equ 0x94
_SENT1DATLbits equ 0x94
SENT1DATH    equ 0x96
_SENT1DATH    equ 0x96
_SENT1DATHbits equ 0x96
CRCCON1      equ 0xB0
_CRCCON1      equ 0xB0
_CRCCON1bits  equ 0xB0
CRCCONL      equ 0xB0
_CRCCONL      equ 0xB0
_CRCCONLbits  equ 0xB0
CRCCON2      equ 0xB2
_CRCCON2      equ 0xB2
_CRCCON2bits  equ 0xB2
CRCCONH      equ 0xB2
_CRCCONH      equ 0xB2
_CRCCONHbits  equ 0xB2
CRCXORL      equ 0xB4
_CRCXORL      equ 0xB4
_CRCXORLbits  equ 0xB4
CRCXORH      equ 0xB6
_CRCXORH      equ 0xB6
_CRCXORHbits  equ 0xB6
CRCDATL      equ 0xB8
_CRCDATL      equ 0xB8
CRCDATH      equ 0xBA
_CRCDATH      equ 0xBA
CRCWDATL     equ 0xBC
_CRCWDATL     equ 0xBC
CRCWDATH     equ 0xBE
_CRCWDATH     equ 0xBE
CLC1CONL     equ 0xC0
_CLC1CONL     equ 0xC0
_CLC1CONLbits equ 0xC0
CLC1CONH     equ 0xC2
_CLC1CONH     equ 0xC2
_CLC1CONHbits equ 0xC2
CLC1SEL      equ 0xC4
_CLC1SEL      equ 0xC4
_CLC1SELbits  equ 0xC4
CLC1SELL     equ 0xC4
_CLC1SELL     equ 0xC4
_CLC1SELLbits equ 0xC4
CLC1GLSL     equ 0xC8
_CLC1GLSL     equ 0xC8
_CLC1GLSLbits equ 0xC8
CLC1GLSH     equ 0xCA
_CLC1GLSH     equ 0xCA
_CLC1GLSHbits equ 0xCA
CLC2CONL     equ 0xCC
_CLC2CONL     equ 0xCC
_CLC2CONLbits equ 0xCC
CLC2CONH     equ 0xCE
_CLC2CONH     equ 0xCE
_CLC2CONHbits equ 0xCE
CLC2SEL      equ 0xD0
_CLC2SEL      equ 0xD0
_CLC2SELbits  equ 0xD0
CLC2SELL     equ 0xD0
_CLC2SELL     equ 0xD0
_CLC2SELLbits equ 0xD0
CLC2GLSL     equ 0xD4
_CLC2GLSL     equ 0xD4
_CLC2GLSLbits equ 0xD4
CLC2GLSH     equ 0xD6
_CLC2GLSH     equ 0xD6
_CLC2GLSHbits equ 0xD6
CLC3CONL     equ 0xD8
_CLC3CONL     equ 0xD8
_CLC3CONLbits equ 0xD8
CLC3CONH     equ 0xDA
_CLC3CONH     equ 0xDA
_CLC3CONHbits equ 0xDA
CLC3SEL      equ 0xDC
_CLC3SEL      equ 0xDC
_CLC3SELbits  equ 0xDC
CLC3SELL     equ 0xDC
_CLC3SELL     equ 0xDC
_CLC3SELLbits equ 0xDC
CLC3GLSL     equ 0xE0
_CLC3GLSL     equ 0xE0
_CLC3GLSLbits equ 0xE0
CLC3GLSH     equ 0xE2
_CLC3GLSH     equ 0xE2
_CLC3GLSHbits equ 0xE2
CLC4CONL     equ 0xE4
_CLC4CONL     equ 0xE4
_CLC4CONLbits equ 0xE4
CLC4CONH     equ 0xE6
_CLC4CONH     equ 0xE6
_CLC4CONHbits equ 0xE6
CLC4SEL      equ 0xE8
_CLC4SEL      equ 0xE8
_CLC4SELbits  equ 0xE8
CLC4SELL     equ 0xE8
_CLC4SELL     equ 0xE8
_CLC4SELLbits equ 0xE8
CLC4GLSL     equ 0xEC
_CLC4GLSL     equ 0xEC
_CLC4GLSLbits equ 0xEC
CLC4GLSH     equ 0xEE
_CLC4GLSH     equ 0xEE
_CLC4GLSHbits equ 0xEE
ECCCONL      equ 0xF0
_ECCCONL      equ 0xF0
_ECCCONLbits  equ 0xF0
ECCCONH      equ 0xF2
_ECCCONH      equ 0xF2
_ECCCONHbits  equ 0xF2
ECCADDRL     equ 0xF4
_ECCADDRL     equ 0xF4
ECCADDRH     equ 0xF6
_ECCADDRH     equ 0xF6
ECCSTATL     equ 0xF8
_ECCSTATL     equ 0xF8
_ECCSTATLbits equ 0xF8
ECCSTATH     equ 0xFA
_ECCSTATH     equ 0xFA
_ECCSTATHbits equ 0xFA
T1CON        equ 0x100
_T1CON        equ 0x100
_T1CONbits    equ 0x100
TMR1         equ 0x104
_TMR1         equ 0x104
PR1          equ 0x108
_PR1          equ 0x108
QEI1CON      equ 0x140
_QEI1CON      equ 0x140
_QEI1CONbits  equ 0x140
QEI1IOC      equ 0x144
_QEI1IOC      equ 0x144
_QEI1IOCbits  equ 0x144
QEI1IOCH     equ 0x146
_QEI1IOCH     equ 0x146
_QEI1IOCHbits equ 0x146
QEI1STAT     equ 0x148
_QEI1STAT     equ 0x148
_QEI1STATbits equ 0x148
POS1CNTL     equ 0x14C
_POS1CNTL     equ 0x14C
POS1CNTH     equ 0x14E
_POS1CNTH     equ 0x14E
POS1HLD      equ 0x152
_POS1HLD      equ 0x152
VEL1CNT      equ 0x154
_VEL1CNT      equ 0x154
VEL1CNTH     equ 0x156
_VEL1CNTH     equ 0x156
VEL1HLD      equ 0x15A
_VEL1HLD      equ 0x15A
INT1TMRL     equ 0x15C
_INT1TMRL     equ 0x15C
INT1TMRH     equ 0x15E
_INT1TMRH     equ 0x15E
INT1HLDL     equ 0x160
_INT1HLDL     equ 0x160
INT1HLDH     equ 0x162
_INT1HLDH     equ 0x162
INDX1CNTL    equ 0x164
_INDX1CNTL    equ 0x164
INDX1CNTH    equ 0x166
_INDX1CNTH    equ 0x166
INDX1HLD     equ 0x16A
_INDX1HLD     equ 0x16A
QEI1GECL     equ 0x16C
_QEI1GECL     equ 0x16C
QEI1ICL      equ 0x16C
_QEI1ICL      equ 0x16C
QEI1GECH     equ 0x16E
_QEI1GECH     equ 0x16E
QEI1ICH      equ 0x16E
_QEI1ICH      equ 0x16E
QEI1LECL     equ 0x170
_QEI1LECL     equ 0x170
QEI1LECH     equ 0x172
_QEI1LECH     equ 0x172
I2C1CON1     equ 0x200
_I2C1CON1     equ 0x200
_I2C1CON1bits equ 0x200
I2C1CONL     equ 0x200
_I2C1CONL     equ 0x200
_I2C1CONLbits equ 0x200
I2C1CON2     equ 0x202
_I2C1CON2     equ 0x202
_I2C1CON2bits equ 0x202
I2C1CONH     equ 0x202
_I2C1CONH     equ 0x202
_I2C1CONHbits equ 0x202
I2C1STAT     equ 0x204
_I2C1STAT     equ 0x204
_I2C1STATbits equ 0x204
I2C1ADD      equ 0x208
_I2C1ADD      equ 0x208
_I2C1ADDbits  equ 0x208
I2C1MSK      equ 0x20C
_I2C1MSK      equ 0x20C
_I2C1MSKbits  equ 0x20C
I2C1BRG      equ 0x210
_I2C1BRG      equ 0x210
I2C1TRN      equ 0x214
_I2C1TRN      equ 0x214
_I2C1TRNbits  equ 0x214
I2C1RCV      equ 0x218
_I2C1RCV      equ 0x218
_I2C1RCVbits  equ 0x218
U1MODE       equ 0x238
_U1MODE       equ 0x238
_U1MODEbits   equ 0x238
U1MODEH      equ 0x23A
_U1MODEH      equ 0x23A
_U1MODEHbits  equ 0x23A
U1STA        equ 0x23C
_U1STA        equ 0x23C
_U1STAbits    equ 0x23C
U1STAH       equ 0x23E
_U1STAH       equ 0x23E
_U1STAHbits   equ 0x23E
U1BRG        equ 0x240
_U1BRG        equ 0x240
_U1BRGbits    equ 0x240
U1BRGH       equ 0x242
_U1BRGH       equ 0x242
_U1BRGHbits   equ 0x242
U1RXREG      equ 0x244
_U1RXREG      equ 0x244
_U1RXREGbits  equ 0x244
U1TXREG      equ 0x248
_U1TXREG      equ 0x248
_U1TXREGbits  equ 0x248
U1P1         equ 0x24C
_U1P1         equ 0x24C
_U1P1bits     equ 0x24C
U1P2         equ 0x24E
_U1P2         equ 0x24E
_U1P2bits     equ 0x24E
U1P3         equ 0x250
_U1P3         equ 0x250
_U1P3bits     equ 0x250
U1P3H        equ 0x252
_U1P3H        equ 0x252
_U1P3Hbits    equ 0x252
U1TXCHK      equ 0x254
_U1TXCHK      equ 0x254
_U1TXCHKbits  equ 0x254
U1RXCHK      equ 0x256
_U1RXCHK      equ 0x256
_U1RXCHKbits  equ 0x256
U1SCCON      equ 0x258
_U1SCCON      equ 0x258
_U1SCCONbits  equ 0x258
U1SCINT      equ 0x25A
_U1SCINT      equ 0x25A
_U1SCINTbits  equ 0x25A
U1INT        equ 0x25C
_U1INT        equ 0x25C
_U1INTbits    equ 0x25C
U2MODE       equ 0x260
_U2MODE       equ 0x260
_U2MODEbits   equ 0x260
U2MODEH      equ 0x262
_U2MODEH      equ 0x262
_U2MODEHbits  equ 0x262
U2STA        equ 0x264
_U2STA        equ 0x264
_U2STAbits    equ 0x264
U2STAH       equ 0x266
_U2STAH       equ 0x266
_U2STAHbits   equ 0x266
U2BRG        equ 0x268
_U2BRG        equ 0x268
_U2BRGbits    equ 0x268
U2BRGH       equ 0x26A
_U2BRGH       equ 0x26A
_U2BRGHbits   equ 0x26A
U2RXREG      equ 0x26C
_U2RXREG      equ 0x26C
_U2RXREGbits  equ 0x26C
U2TXREG      equ 0x270
_U2TXREG      equ 0x270
_U2TXREGbits  equ 0x270
U2P1         equ 0x274
_U2P1         equ 0x274
_U2P1bits     equ 0x274
U2P2         equ 0x276
_U2P2         equ 0x276
_U2P2bits     equ 0x276
U2P3         equ 0x278
_U2P3         equ 0x278
_U2P3bits     equ 0x278
U2P3H        equ 0x27A
_U2P3H        equ 0x27A
_U2P3Hbits    equ 0x27A
U2TXCHK      equ 0x27C
_U2TXCHK      equ 0x27C
_U2TXCHKbits  equ 0x27C
U2RXCHK      equ 0x27E
_U2RXCHK      equ 0x27E
_U2RXCHKbits  equ 0x27E
U2SCCON      equ 0x280
_U2SCCON      equ 0x280
_U2SCCONbits  equ 0x280
U2SCINT      equ 0x282
_U2SCINT      equ 0x282
_U2SCINTbits  equ 0x282
U2INT        equ 0x284
_U2INT        equ 0x284
_U2INTbits    equ 0x284
SPI1CON1     equ 0x2AC
_SPI1CON1     equ 0x2AC
_SPI1CON1bits equ 0x2AC
SPI1CON1L    equ 0x2AC
_SPI1CON1L    equ 0x2AC
_SPI1CON1Lbits equ 0x2AC
SPI1CON1H    equ 0x2AE
_SPI1CON1H    equ 0x2AE
_SPI1CON1Hbits equ 0x2AE
SPI1CON2     equ 0x2AE
_SPI1CON2     equ 0x2AE
_SPI1CON2bits equ 0x2AE
SPI1CON2L    equ 0x2B0
_SPI1CON2L    equ 0x2B0
_SPI1CON2Lbits equ 0x2B0
SPI1CON3     equ 0x2B0
_SPI1CON3     equ 0x2B0
_SPI1CON3bits equ 0x2B0
SPI1STATL    equ 0x2B4
_SPI1STATL    equ 0x2B4
_SPI1STATLbits equ 0x2B4
SPI1STATH    equ 0x2B6
_SPI1STATH    equ 0x2B6
_SPI1STATHbits equ 0x2B6
SPI1BUFL     equ 0x2B8
_SPI1BUFL     equ 0x2B8
_SPI1BUFLbits equ 0x2B8
SPI1BUFH     equ 0x2BA
_SPI1BUFH     equ 0x2BA
_SPI1BUFHbits equ 0x2BA
SPI1BRGL     equ 0x2BC
_SPI1BRGL     equ 0x2BC
_SPI1BRGLbits equ 0x2BC
SPI1IMSK1    equ 0x2C0
_SPI1IMSK1    equ 0x2C0
_SPI1IMSK1bits equ 0x2C0
SPI1IMSKL    equ 0x2C0
_SPI1IMSKL    equ 0x2C0
_SPI1IMSKLbits equ 0x2C0
SPI1IMSK2    equ 0x2C2
_SPI1IMSK2    equ 0x2C2
_SPI1IMSK2bits equ 0x2C2
SPI1IMSKH    equ 0x2C2
_SPI1IMSKH    equ 0x2C2
_SPI1IMSKHbits equ 0x2C2
SPI1URDTL    equ 0x2C4
_SPI1URDTL    equ 0x2C4
_SPI1URDTLbits equ 0x2C4
SPI1URDTH    equ 0x2C6
_SPI1URDTH    equ 0x2C6
_SPI1URDTHbits equ 0x2C6
SPI2CON1     equ 0x2C8
_SPI2CON1     equ 0x2C8
_SPI2CON1bits equ 0x2C8
SPI2CON1L    equ 0x2C8
_SPI2CON1L    equ 0x2C8
_SPI2CON1Lbits equ 0x2C8
SPI2CON1H    equ 0x2CA
_SPI2CON1H    equ 0x2CA
_SPI2CON1Hbits equ 0x2CA
SPI2CON2     equ 0x2CA
_SPI2CON2     equ 0x2CA
_SPI2CON2bits equ 0x2CA
SPI2CON2L    equ 0x2CC
_SPI2CON2L    equ 0x2CC
_SPI2CON2Lbits equ 0x2CC
SPI2CON3     equ 0x2CC
_SPI2CON3     equ 0x2CC
_SPI2CON3bits equ 0x2CC
SPI2STATL    equ 0x2D0
_SPI2STATL    equ 0x2D0
_SPI2STATLbits equ 0x2D0
SPI2STATH    equ 0x2D2
_SPI2STATH    equ 0x2D2
_SPI2STATHbits equ 0x2D2
SPI2BUFL     equ 0x2D4
_SPI2BUFL     equ 0x2D4
_SPI2BUFLbits equ 0x2D4
SPI2BUFH     equ 0x2D6
_SPI2BUFH     equ 0x2D6
_SPI2BUFHbits equ 0x2D6
SPI2BRGL     equ 0x2D8
_SPI2BRGL     equ 0x2D8
_SPI2BRGLbits equ 0x2D8
SPI2IMSK1    equ 0x2DC
_SPI2IMSK1    equ 0x2DC
_SPI2IMSK1bits equ 0x2DC
SPI2IMSKL    equ 0x2DC
_SPI2IMSKL    equ 0x2DC
_SPI2IMSKLbits equ 0x2DC
SPI2IMSK2    equ 0x2DE
_SPI2IMSK2    equ 0x2DE
_SPI2IMSK2bits equ 0x2DE
SPI2IMSKH    equ 0x2DE
_SPI2IMSKH    equ 0x2DE
_SPI2IMSKHbits equ 0x2DE
SPI2URDTL    equ 0x2E0
_SPI2URDTL    equ 0x2E0
_SPI2URDTLbits equ 0x2E0
SPI2URDTH    equ 0x2E2
_SPI2URDTH    equ 0x2E2
_SPI2URDTHbits equ 0x2E2
PCLKCON      equ 0x300
_PCLKCON      equ 0x300
_PCLKCONbits  equ 0x300
FSCL         equ 0x302
_FSCL         equ 0x302
FSMINPER     equ 0x304
_FSMINPER     equ 0x304
MPHASE       equ 0x306
_MPHASE       equ 0x306
MDC          equ 0x308
_MDC          equ 0x308
MPER         equ 0x30A
_MPER         equ 0x30A
LFSR         equ 0x30C
_LFSR         equ 0x30C
_LFSRbits     equ 0x30C
CMBTRIGL     equ 0x30E
_CMBTRIGL     equ 0x30E
_CMBTRIGLbits equ 0x30E
CMBTRIGH     equ 0x310
_CMBTRIGH     equ 0x310
_CMBTRIGHbits equ 0x310
LOGCONA      equ 0x312
_LOGCONA      equ 0x312
_LOGCONAbits  equ 0x312
LOGCONB      equ 0x314
_LOGCONB      equ 0x314
_LOGCONBbits  equ 0x314
LOGCONC      equ 0x316
_LOGCONC      equ 0x316
_LOGCONCbits  equ 0x316
LOGCOND      equ 0x318
_LOGCOND      equ 0x318
_LOGCONDbits  equ 0x318
LOGCONE      equ 0x31A
_LOGCONE      equ 0x31A
_LOGCONEbits  equ 0x31A
LOGCONF      equ 0x31C
_LOGCONF      equ 0x31C
_LOGCONFbits  equ 0x31C
PWMEVTA      equ 0x31E
_PWMEVTA      equ 0x31E
_PWMEVTAbits  equ 0x31E
PWMEVTB      equ 0x320
_PWMEVTB      equ 0x320
_PWMEVTBbits  equ 0x320
PWMEVTC      equ 0x322
_PWMEVTC      equ 0x322
_PWMEVTCbits  equ 0x322
PWMEVTD      equ 0x324
_PWMEVTD      equ 0x324
_PWMEVTDbits  equ 0x324
PWMEVTE      equ 0x326
_PWMEVTE      equ 0x326
_PWMEVTEbits  equ 0x326
PWMEVTF      equ 0x328
_PWMEVTF      equ 0x328
_PWMEVTFbits  equ 0x328
PG1CONL      equ 0x32A
_PG1CONL      equ 0x32A
_PG1CONLbits  equ 0x32A
PG1CONH      equ 0x32C
_PG1CONH      equ 0x32C
_PG1CONHbits  equ 0x32C
PG1STAT      equ 0x32E
_PG1STAT      equ 0x32E
_PG1STATbits  equ 0x32E
PG1IOCONL    equ 0x330
_PG1IOCONL    equ 0x330
_PG1IOCONLbits equ 0x330
PG1IOCONH    equ 0x332
_PG1IOCONH    equ 0x332
_PG1IOCONHbits equ 0x332
PG1EVTL      equ 0x334
_PG1EVTL      equ 0x334
_PG1EVTLbits  equ 0x334
PG1EVTH      equ 0x336
_PG1EVTH      equ 0x336
_PG1EVTHbits  equ 0x336
PG1FPCIL     equ 0x338
_PG1FPCIL     equ 0x338
_PG1FPCILbits equ 0x338
PG1FPCIH     equ 0x33A
_PG1FPCIH     equ 0x33A
_PG1FPCIHbits equ 0x33A
PG1CLPCIL    equ 0x33C
_PG1CLPCIL    equ 0x33C
_PG1CLPCILbits equ 0x33C
PG1CLPCIH    equ 0x33E
_PG1CLPCIH    equ 0x33E
_PG1CLPCIHbits equ 0x33E
PG1FFPCIL    equ 0x340
_PG1FFPCIL    equ 0x340
_PG1FFPCILbits equ 0x340
PG1FFPCIH    equ 0x342
_PG1FFPCIH    equ 0x342
_PG1FFPCIHbits equ 0x342
PG1SPCIL     equ 0x344
_PG1SPCIL     equ 0x344
_PG1SPCILbits equ 0x344
PG1SPCIH     equ 0x346
_PG1SPCIH     equ 0x346
_PG1SPCIHbits equ 0x346
PG1LEBL      equ 0x348
_PG1LEBL      equ 0x348
PG1LEBH      equ 0x34A
_PG1LEBH      equ 0x34A
_PG1LEBHbits  equ 0x34A
PG1PHASE     equ 0x34C
_PG1PHASE     equ 0x34C
PG1DC        equ 0x34E
_PG1DC        equ 0x34E
PG1DCA       equ 0x350
_PG1DCA       equ 0x350
_PG1DCAbits   equ 0x350
PG1PER       equ 0x352
_PG1PER       equ 0x352
PG1TRIGA     equ 0x354
_PG1TRIGA     equ 0x354
PG1TRIGB     equ 0x356
_PG1TRIGB     equ 0x356
PG1TRIGC     equ 0x358
_PG1TRIGC     equ 0x358
PG1DTL       equ 0x35A
_PG1DTL       equ 0x35A
_PG1DTLbits   equ 0x35A
PG1DTH       equ 0x35C
_PG1DTH       equ 0x35C
_PG1DTHbits   equ 0x35C
PG1CAP       equ 0x35E
_PG1CAP       equ 0x35E
PG2CONL      equ 0x360
_PG2CONL      equ 0x360
_PG2CONLbits  equ 0x360
PG2CONH      equ 0x362
_PG2CONH      equ 0x362
_PG2CONHbits  equ 0x362
PG2STAT      equ 0x364
_PG2STAT      equ 0x364
_PG2STATbits  equ 0x364
PG2IOCONL    equ 0x366
_PG2IOCONL    equ 0x366
_PG2IOCONLbits equ 0x366
PG2IOCONH    equ 0x368
_PG2IOCONH    equ 0x368
_PG2IOCONHbits equ 0x368
PG2EVTL      equ 0x36A
_PG2EVTL      equ 0x36A
_PG2EVTLbits  equ 0x36A
PG2EVTH      equ 0x36C
_PG2EVTH      equ 0x36C
_PG2EVTHbits  equ 0x36C
PG2FPCIL     equ 0x36E
_PG2FPCIL     equ 0x36E
_PG2FPCILbits equ 0x36E
PG2FPCIH     equ 0x370
_PG2FPCIH     equ 0x370
_PG2FPCIHbits equ 0x370
PG2CLPCIL    equ 0x372
_PG2CLPCIL    equ 0x372
_PG2CLPCILbits equ 0x372
PG2CLPCIH    equ 0x374
_PG2CLPCIH    equ 0x374
_PG2CLPCIHbits equ 0x374
PG2FFPCIL    equ 0x376
_PG2FFPCIL    equ 0x376
_PG2FFPCILbits equ 0x376
PG2FFPCIH    equ 0x378
_PG2FFPCIH    equ 0x378
_PG2FFPCIHbits equ 0x378
PG2SPCIL     equ 0x37A
_PG2SPCIL     equ 0x37A
_PG2SPCILbits equ 0x37A
PG2SPCIH     equ 0x37C
_PG2SPCIH     equ 0x37C
_PG2SPCIHbits equ 0x37C
PG2LEBL      equ 0x37E
_PG2LEBL      equ 0x37E
PG2LEBH      equ 0x380
_PG2LEBH      equ 0x380
_PG2LEBHbits  equ 0x380
PG2PHASE     equ 0x382
_PG2PHASE     equ 0x382
PG2DC        equ 0x384
_PG2DC        equ 0x384
PG2DCA       equ 0x386
_PG2DCA       equ 0x386
_PG2DCAbits   equ 0x386
PG2PER       equ 0x388
_PG2PER       equ 0x388
PG2TRIGA     equ 0x38A
_PG2TRIGA     equ 0x38A
PG2TRIGB     equ 0x38C
_PG2TRIGB     equ 0x38C
PG2TRIGC     equ 0x38E
_PG2TRIGC     equ 0x38E
PG2DTL       equ 0x390
_PG2DTL       equ 0x390
_PG2DTLbits   equ 0x390
PG2DTH       equ 0x392
_PG2DTH       equ 0x392
_PG2DTHbits   equ 0x392
PG2CAP       equ 0x394
_PG2CAP       equ 0x394
PG3CONL      equ 0x396
_PG3CONL      equ 0x396
_PG3CONLbits  equ 0x396
PG3CONH      equ 0x398
_PG3CONH      equ 0x398
_PG3CONHbits  equ 0x398
PG3STAT      equ 0x39A
_PG3STAT      equ 0x39A
_PG3STATbits  equ 0x39A
PG3IOCONL    equ 0x39C
_PG3IOCONL    equ 0x39C
_PG3IOCONLbits equ 0x39C
PG3IOCONH    equ 0x39E
_PG3IOCONH    equ 0x39E
_PG3IOCONHbits equ 0x39E
PG3EVTL      equ 0x3A0
_PG3EVTL      equ 0x3A0
_PG3EVTLbits  equ 0x3A0
PG3EVTH      equ 0x3A2
_PG3EVTH      equ 0x3A2
_PG3EVTHbits  equ 0x3A2
PG3FPCIL     equ 0x3A4
_PG3FPCIL     equ 0x3A4
_PG3FPCILbits equ 0x3A4
PG3FPCIH     equ 0x3A6
_PG3FPCIH     equ 0x3A6
_PG3FPCIHbits equ 0x3A6
PG3CLPCIL    equ 0x3A8
_PG3CLPCIL    equ 0x3A8
_PG3CLPCILbits equ 0x3A8
PG3CLPCIH    equ 0x3AA
_PG3CLPCIH    equ 0x3AA
_PG3CLPCIHbits equ 0x3AA
PG3FFPCIL    equ 0x3AC
_PG3FFPCIL    equ 0x3AC
_PG3FFPCILbits equ 0x3AC
PG3FFPCIH    equ 0x3AE
_PG3FFPCIH    equ 0x3AE
_PG3FFPCIHbits equ 0x3AE
PG3SPCIL     equ 0x3B0
_PG3SPCIL     equ 0x3B0
_PG3SPCILbits equ 0x3B0
PG3SPCIH     equ 0x3B2
_PG3SPCIH     equ 0x3B2
_PG3SPCIHbits equ 0x3B2
PG3LEBL      equ 0x3B4
_PG3LEBL      equ 0x3B4
PG3LEBH      equ 0x3B6
_PG3LEBH      equ 0x3B6
_PG3LEBHbits  equ 0x3B6
PG3PHASE     equ 0x3B8
_PG3PHASE     equ 0x3B8
PG3DC        equ 0x3BA
_PG3DC        equ 0x3BA
PG3DCA       equ 0x3BC
_PG3DCA       equ 0x3BC
_PG3DCAbits   equ 0x3BC
PG3PER       equ 0x3BE
_PG3PER       equ 0x3BE
PG3TRIGA     equ 0x3C0
_PG3TRIGA     equ 0x3C0
PG3TRIGB     equ 0x3C2
_PG3TRIGB     equ 0x3C2
PG3TRIGC     equ 0x3C4
_PG3TRIGC     equ 0x3C4
PG3DTL       equ 0x3C6
_PG3DTL       equ 0x3C6
_PG3DTLbits   equ 0x3C6
PG3DTH       equ 0x3C8
_PG3DTH       equ 0x3C8
_PG3DTHbits   equ 0x3C8
PG3CAP       equ 0x3CA
_PG3CAP       equ 0x3CA
PG4CONL      equ 0x3CC
_PG4CONL      equ 0x3CC
_PG4CONLbits  equ 0x3CC
PG4CONH      equ 0x3CE
_PG4CONH      equ 0x3CE
_PG4CONHbits  equ 0x3CE
PG4STAT      equ 0x3D0
_PG4STAT      equ 0x3D0
_PG4STATbits  equ 0x3D0
PG4IOCONL    equ 0x3D2
_PG4IOCONL    equ 0x3D2
_PG4IOCONLbits equ 0x3D2
PG4IOCONH    equ 0x3D4
_PG4IOCONH    equ 0x3D4
_PG4IOCONHbits equ 0x3D4
PG4EVTL      equ 0x3D6
_PG4EVTL      equ 0x3D6
_PG4EVTLbits  equ 0x3D6
PG4EVTH      equ 0x3D8
_PG4EVTH      equ 0x3D8
_PG4EVTHbits  equ 0x3D8
PG4FPCIL     equ 0x3DA
_PG4FPCIL     equ 0x3DA
_PG4FPCILbits equ 0x3DA
PG4FPCIH     equ 0x3DC
_PG4FPCIH     equ 0x3DC
_PG4FPCIHbits equ 0x3DC
PG4CLPCIL    equ 0x3DE
_PG4CLPCIL    equ 0x3DE
_PG4CLPCILbits equ 0x3DE
PG4CLPCIH    equ 0x3E0
_PG4CLPCIH    equ 0x3E0
_PG4CLPCIHbits equ 0x3E0
PG4FFPCIL    equ 0x3E2
_PG4FFPCIL    equ 0x3E2
_PG4FFPCILbits equ 0x3E2
PG4FFPCIH    equ 0x3E4
_PG4FFPCIH    equ 0x3E4
_PG4FFPCIHbits equ 0x3E4
PG4SPCIL     equ 0x3E6
_PG4SPCIL     equ 0x3E6
_PG4SPCILbits equ 0x3E6
PG4SPCIH     equ 0x3E8
_PG4SPCIH     equ 0x3E8
_PG4SPCIHbits equ 0x3E8
PG4LEBL      equ 0x3EA
_PG4LEBL      equ 0x3EA
PG4LEBH      equ 0x3EC
_PG4LEBH      equ 0x3EC
_PG4LEBHbits  equ 0x3EC
PG4PHASE     equ 0x3EE
_PG4PHASE     equ 0x3EE
PG4DC        equ 0x3F0
_PG4DC        equ 0x3F0
PG4DCA       equ 0x3F2
_PG4DCA       equ 0x3F2
_PG4DCAbits   equ 0x3F2
PG4PER       equ 0x3F4
_PG4PER       equ 0x3F4
PG4TRIGA     equ 0x3F6
_PG4TRIGA     equ 0x3F6
PG4TRIGB     equ 0x3F8
_PG4TRIGB     equ 0x3F8
PG4TRIGC     equ 0x3FA
_PG4TRIGC     equ 0x3FA
PG4DTL       equ 0x3FC
_PG4DTL       equ 0x3FC
_PG4DTLbits   equ 0x3FC
PG4DTH       equ 0x3FE
_PG4DTH       equ 0x3FE
_PG4DTHbits   equ 0x3FE
PG4CAP       equ 0x400
_PG4CAP       equ 0x400
IFS0         equ 0x800
_IFS0         equ 0x800
_IFS0bits     equ 0x800
IFS1         equ 0x802
_IFS1         equ 0x802
_IFS1bits     equ 0x802
IFS2         equ 0x804
_IFS2         equ 0x804
_IFS2bits     equ 0x804
IFS3         equ 0x806
_IFS3         equ 0x806
_IFS3bits     equ 0x806
IFS4         equ 0x808
_IFS4         equ 0x808
_IFS4bits     equ 0x808
IFS5         equ 0x80A
_IFS5         equ 0x80A
_IFS5bits     equ 0x80A
IFS6         equ 0x80C
_IFS6         equ 0x80C
_IFS6bits     equ 0x80C
IFS7         equ 0x80E
_IFS7         equ 0x80E
_IFS7bits     equ 0x80E
IFS10        equ 0x814
_IFS10        equ 0x814
_IFS10bits    equ 0x814
IFS11        equ 0x816
_IFS11        equ 0x816
_IFS11bits    equ 0x816
IEC0         equ 0x820
_IEC0         equ 0x820
_IEC0bits     equ 0x820
IEC1         equ 0x822
_IEC1         equ 0x822
_IEC1bits     equ 0x822
IEC2         equ 0x824
_IEC2         equ 0x824
_IEC2bits     equ 0x824
IEC3         equ 0x826
_IEC3         equ 0x826
_IEC3bits     equ 0x826
IEC4         equ 0x828
_IEC4         equ 0x828
_IEC4bits     equ 0x828
IEC5         equ 0x82A
_IEC5         equ 0x82A
_IEC5bits     equ 0x82A
IEC6         equ 0x82C
_IEC6         equ 0x82C
_IEC6bits     equ 0x82C
IEC7         equ 0x82E
_IEC7         equ 0x82E
_IEC7bits     equ 0x82E
IEC10        equ 0x834
_IEC10        equ 0x834
_IEC10bits    equ 0x834
IEC11        equ 0x836
_IEC11        equ 0x836
_IEC11bits    equ 0x836
IPC0         equ 0x840
_IPC0         equ 0x840
_IPC0bits     equ 0x840
IPC1         equ 0x842
_IPC1         equ 0x842
_IPC1bits     equ 0x842
IPC2         equ 0x844
_IPC2         equ 0x844
_IPC2bits     equ 0x844
IPC3         equ 0x846
_IPC3         equ 0x846
_IPC3bits     equ 0x846
IPC4         equ 0x848
_IPC4         equ 0x848
_IPC4bits     equ 0x848
IPC5         equ 0x84A
_IPC5         equ 0x84A
_IPC5bits     equ 0x84A
IPC6         equ 0x84C
_IPC6         equ 0x84C
_IPC6bits     equ 0x84C
IPC7         equ 0x84E
_IPC7         equ 0x84E
_IPC7bits     equ 0x84E
IPC8         equ 0x850
_IPC8         equ 0x850
_IPC8bits     equ 0x850
IPC9         equ 0x852
_IPC9         equ 0x852
_IPC9bits     equ 0x852
IPC10        equ 0x854
_IPC10        equ 0x854
_IPC10bits    equ 0x854
IPC11        equ 0x856
_IPC11        equ 0x856
_IPC11bits    equ 0x856
IPC12        equ 0x858
_IPC12        equ 0x858
_IPC12bits    equ 0x858
IPC14        equ 0x85C
