mikeakohn/naken_asm/include/dspic/p33ck64mc105.inc
_IPC14        equ 0x85C
_IPC14bits    equ 0x85C
IPC15        equ 0x85E
_IPC15        equ 0x85E
_IPC15bits    equ 0x85E
IPC16        equ 0x860
_IPC16        equ 0x860
_IPC16bits    equ 0x860
IPC17        equ 0x862
_IPC17        equ 0x862
_IPC17bits    equ 0x862
IPC18        equ 0x864
_IPC18        equ 0x864
_IPC18bits    equ 0x864
IPC19        equ 0x866
_IPC19        equ 0x866
_IPC19bits    equ 0x866
IPC20        equ 0x868
_IPC20        equ 0x868
_IPC20bits    equ 0x868
IPC21        equ 0x86A
_IPC21        equ 0x86A
_IPC21bits    equ 0x86A
IPC22        equ 0x86C
_IPC22        equ 0x86C
_IPC22bits    equ 0x86C
IPC23        equ 0x86E
_IPC23        equ 0x86E
_IPC23bits    equ 0x86E
IPC24        equ 0x870
_IPC24        equ 0x870
_IPC24bits    equ 0x870
IPC25        equ 0x872
_IPC25        equ 0x872
_IPC25bits    equ 0x872
IPC26        equ 0x874
_IPC26        equ 0x874
_IPC26bits    equ 0x874
IPC27        equ 0x876
_IPC27        equ 0x876
_IPC27bits    equ 0x876
IPC28        equ 0x878
_IPC28        equ 0x878
_IPC28bits    equ 0x878
IPC29        equ 0x87A
_IPC29        equ 0x87A
_IPC29bits    equ 0x87A
IPC30        equ 0x87C
_IPC30        equ 0x87C
_IPC30bits    equ 0x87C
IPC31        equ 0x87E
_IPC31        equ 0x87E
_IPC31bits    equ 0x87E
IPC42        equ 0x894
_IPC42        equ 0x894
_IPC42bits    equ 0x894
IPC43        equ 0x896
_IPC43        equ 0x896
_IPC43bits    equ 0x896
IPC44        equ 0x898
_IPC44        equ 0x898
_IPC44bits    equ 0x898
IPC45        equ 0x89A
_IPC45        equ 0x89A
_IPC45bits    equ 0x89A
IPC47        equ 0x89E
_IPC47        equ 0x89E
_IPC47bits    equ 0x89E
INTCON1      equ 0x8C0
_INTCON1      equ 0x8C0
_INTCON1bits  equ 0x8C0
INTCON2      equ 0x8C2
_INTCON2      equ 0x8C2
_INTCON2bits  equ 0x8C2
INTCON3      equ 0x8C4
_INTCON3      equ 0x8C4
_INTCON3bits  equ 0x8C4
INTCON4      equ 0x8C6
_INTCON4      equ 0x8C6
_INTCON4bits  equ 0x8C6
INTTREG      equ 0x8C8
_INTTREG      equ 0x8C8
_INTTREGbits  equ 0x8C8
NVMCON       equ 0x8D0
_NVMCON       equ 0x8D0
_NVMCONbits   equ 0x8D0
NVMADR       equ 0x8D2
_NVMADR       equ 0x8D2
_NVMADRbits   equ 0x8D2
NVMADRL      equ 0x8D2
_NVMADRL      equ 0x8D2
_NVMADRLbits  equ 0x8D2
NVMADRH      equ 0x8D4
_NVMADRH      equ 0x8D4
_NVMADRHbits  equ 0x8D4
NVMADRU      equ 0x8D4
_NVMADRU      equ 0x8D4
_NVMADRUbits  equ 0x8D4
NVMKEY       equ 0x8D6
_NVMKEY       equ 0x8D6
NVMSRCADDR   equ 0x8D8
_NVMSRCADDR   equ 0x8D8
_NVMSRCADDRbits equ 0x8D8
NVMSRCADR    equ 0x8D8
_NVMSRCADR    equ 0x8D8
_NVMSRCADRbits equ 0x8D8
NVMSRCADRL   equ 0x8D8
_NVMSRCADRL   equ 0x8D8
_NVMSRCADRLbits equ 0x8D8
NVMSRCADRH   equ 0x8DA
_NVMSRCADRH   equ 0x8DA
_NVMSRCADRHbits equ 0x8DA
AMPCON1L     equ 0x8DC
_AMPCON1L     equ 0x8DC
_AMPCON1Lbits equ 0x8DC
AMPCON1H     equ 0x8DE
_AMPCON1H     equ 0x8DE
_AMPCON1Hbits equ 0x8DE
BIASCON      equ 0x8F0
_BIASCON      equ 0x8F0
_BIASCONbits  equ 0x8F0
IBIASCONL    equ 0x8F4
_IBIASCONL    equ 0x8F4
_IBIASCONLbits equ 0x8F4
IBIASCONH    equ 0x8F6
_IBIASCONH    equ 0x8F6
_IBIASCONHbits equ 0x8F6
PTGCST       equ 0x900
_PTGCST       equ 0x900
_PTGCSTbits   equ 0x900
PTGCON       equ 0x902
_PTGCON       equ 0x902
_PTGCONbits   equ 0x902
PTGBTE       equ 0x904
_PTGBTE       equ 0x904
_PTGBTEbits   equ 0x904
PTGBTEH      equ 0x906
_PTGBTEH      equ 0x906
_PTGBTEHbits  equ 0x906
PTGHOLD      equ 0x908
_PTGHOLD      equ 0x908
PTGT0LIM     equ 0x90C
_PTGT0LIM     equ 0x90C
PTGT1LIM     equ 0x910
_PTGT1LIM     equ 0x910
PTGSDLIM     equ 0x914
_PTGSDLIM     equ 0x914
PTGC0LIM     equ 0x918
_PTGC0LIM     equ 0x918
PTGC1LIM     equ 0x91C
_PTGC1LIM     equ 0x91C
PTGADJ       equ 0x920
_PTGADJ       equ 0x920
PTGL0        equ 0x924
_PTGL0        equ 0x924
PTGQPTR      equ 0x928
_PTGQPTR      equ 0x928
_PTGQPTRbits  equ 0x928
PTGQUE0      equ 0x930
_PTGQUE0      equ 0x930
_PTGQUE0bits  equ 0x930
PTGQUE1      equ 0x932
_PTGQUE1      equ 0x932
_PTGQUE1bits  equ 0x932
PTGQUE2      equ 0x934
_PTGQUE2      equ 0x934
_PTGQUE2bits  equ 0x934
PTGQUE3      equ 0x936
_PTGQUE3      equ 0x936
_PTGQUE3bits  equ 0x936
PTGQUE4      equ 0x938
_PTGQUE4      equ 0x938
_PTGQUE4bits  equ 0x938
PTGQUE5      equ 0x93A
_PTGQUE5      equ 0x93A
_PTGQUE5bits  equ 0x93A
PTGQUE6      equ 0x93C
_PTGQUE6      equ 0x93C
_PTGQUE6bits  equ 0x93C
PTGQUE7      equ 0x93E
_PTGQUE7      equ 0x93E
_PTGQUE7bits  equ 0x93E
PTGQUE8      equ 0x940
_PTGQUE8      equ 0x940
_PTGQUE8bits  equ 0x940
PTGQUE9      equ 0x942
_PTGQUE9      equ 0x942
_PTGQUE9bits  equ 0x942
PTGQUE10     equ 0x944
_PTGQUE10     equ 0x944
_PTGQUE10bits equ 0x944
PTGQUE11     equ 0x946
_PTGQUE11     equ 0x946
_PTGQUE11bits equ 0x946
PTGQUE12     equ 0x948
_PTGQUE12     equ 0x948
_PTGQUE12bits equ 0x948
PTGQUE13     equ 0x94A
_PTGQUE13     equ 0x94A
_PTGQUE13bits equ 0x94A
PTGQUE14     equ 0x94C
_PTGQUE14     equ 0x94C
_PTGQUE14bits equ 0x94C
PTGQUE15     equ 0x94E
_PTGQUE15     equ 0x94E
_PTGQUE15bits equ 0x94E
CCP1CON1L    equ 0x950
_CCP1CON1L    equ 0x950
_CCP1CON1Lbits equ 0x950
CCP1CON1H    equ 0x952
_CCP1CON1H    equ 0x952
_CCP1CON1Hbits equ 0x952
CCP1CON2L    equ 0x954
_CCP1CON2L    equ 0x954
_CCP1CON2Lbits equ 0x954
CCP1CON2H    equ 0x956
_CCP1CON2H    equ 0x956
_CCP1CON2Hbits equ 0x956
CCP1CON3H    equ 0x95A
_CCP1CON3H    equ 0x95A
_CCP1CON3Hbits equ 0x95A
CCP1STAT     equ 0x95C
_CCP1STAT     equ 0x95C
_CCP1STATbits equ 0x95C
CCP1STATL    equ 0x95C
_CCP1STATL    equ 0x95C
_CCP1STATLbits equ 0x95C
CCP1STATH    equ 0x95E
_CCP1STATH    equ 0x95E
_CCP1STATHbits equ 0x95E
CCP1TMRL     equ 0x960
_CCP1TMRL     equ 0x960
CCP1TMRH     equ 0x962
_CCP1TMRH     equ 0x962
CCP1PRL      equ 0x964
_CCP1PRL      equ 0x964
CCP1PRH      equ 0x966
_CCP1PRH      equ 0x966
CCP1RA       equ 0x968
_CCP1RA       equ 0x968
CCP1RAL      equ 0x968
_CCP1RAL      equ 0x968
CCP1RB       equ 0x96C
_CCP1RB       equ 0x96C
CCP1RBL      equ 0x96C
_CCP1RBL      equ 0x96C
CCP1BUFL     equ 0x970
_CCP1BUFL     equ 0x970
CCP1BUFH     equ 0x972
_CCP1BUFH     equ 0x972
CCP2CON1L    equ 0x974
_CCP2CON1L    equ 0x974
_CCP2CON1Lbits equ 0x974
CCP2CON1H    equ 0x976
_CCP2CON1H    equ 0x976
_CCP2CON1Hbits equ 0x976
CCP2CON2L    equ 0x978
_CCP2CON2L    equ 0x978
_CCP2CON2Lbits equ 0x978
CCP2CON2H    equ 0x97A
_CCP2CON2H    equ 0x97A
_CCP2CON2Hbits equ 0x97A
CCP2CON3H    equ 0x97E
_CCP2CON3H    equ 0x97E
_CCP2CON3Hbits equ 0x97E
CCP2STAT     equ 0x980
_CCP2STAT     equ 0x980
_CCP2STATbits equ 0x980
CCP2STATL    equ 0x980
_CCP2STATL    equ 0x980
_CCP2STATLbits equ 0x980
CCP2STATH    equ 0x982
_CCP2STATH    equ 0x982
_CCP2STATHbits equ 0x982
CCP2TMRL     equ 0x984
_CCP2TMRL     equ 0x984
CCP2TMRH     equ 0x986
_CCP2TMRH     equ 0x986
CCP2PRL      equ 0x988
_CCP2PRL      equ 0x988
CCP2PRH      equ 0x98A
_CCP2PRH      equ 0x98A
CCP2RA       equ 0x98C
_CCP2RA       equ 0x98C
CCP2RAL      equ 0x98C
_CCP2RAL      equ 0x98C
CCP2RB       equ 0x990
_CCP2RB       equ 0x990
CCP2RBL      equ 0x990
_CCP2RBL      equ 0x990
CCP2BUFL     equ 0x994
_CCP2BUFL     equ 0x994
CCP2BUFH     equ 0x996
_CCP2BUFH     equ 0x996
CCP3CON1L    equ 0x998
_CCP3CON1L    equ 0x998
_CCP3CON1Lbits equ 0x998
CCP3CON1H    equ 0x99A
_CCP3CON1H    equ 0x99A
_CCP3CON1Hbits equ 0x99A
CCP3CON2L    equ 0x99C
_CCP3CON2L    equ 0x99C
_CCP3CON2Lbits equ 0x99C
CCP3CON2H    equ 0x99E
_CCP3CON2H    equ 0x99E
_CCP3CON2Hbits equ 0x99E
CCP3CON3H    equ 0x9A2
_CCP3CON3H    equ 0x9A2
_CCP3CON3Hbits equ 0x9A2
CCP3STAT     equ 0x9A4
_CCP3STAT     equ 0x9A4
_CCP3STATbits equ 0x9A4
CCP3STATL    equ 0x9A4
_CCP3STATL    equ 0x9A4
_CCP3STATLbits equ 0x9A4
CCP3STATH    equ 0x9A6
_CCP3STATH    equ 0x9A6
_CCP3STATHbits equ 0x9A6
CCP3TMRL     equ 0x9A8
_CCP3TMRL     equ 0x9A8
CCP3TMRH     equ 0x9AA
_CCP3TMRH     equ 0x9AA
CCP3PRL      equ 0x9AC
_CCP3PRL      equ 0x9AC
CCP3PRH      equ 0x9AE
_CCP3PRH      equ 0x9AE
CCP3RA       equ 0x9B0
_CCP3RA       equ 0x9B0
CCP3RAL      equ 0x9B0
_CCP3RAL      equ 0x9B0
CCP3RB       equ 0x9B4
_CCP3RB       equ 0x9B4
CCP3RBL      equ 0x9B4
_CCP3RBL      equ 0x9B4
CCP3BUFL     equ 0x9B8
_CCP3BUFL     equ 0x9B8
CCP3BUFH     equ 0x9BA
_CCP3BUFH     equ 0x9BA
CCP4CON1L    equ 0x9BC
_CCP4CON1L    equ 0x9BC
_CCP4CON1Lbits equ 0x9BC
CCP4CON1H    equ 0x9BE
_CCP4CON1H    equ 0x9BE
_CCP4CON1Hbits equ 0x9BE
CCP4CON2L    equ 0x9C0
_CCP4CON2L    equ 0x9C0
_CCP4CON2Lbits equ 0x9C0
CCP4CON2H    equ 0x9C2
_CCP4CON2H    equ 0x9C2
_CCP4CON2Hbits equ 0x9C2
CCP4CON3H    equ 0x9C6
_CCP4CON3H    equ 0x9C6
_CCP4CON3Hbits equ 0x9C6
CCP4STAT     equ 0x9C8
_CCP4STAT     equ 0x9C8
_CCP4STATbits equ 0x9C8
CCP4STATL    equ 0x9C8
_CCP4STATL    equ 0x9C8
_CCP4STATLbits equ 0x9C8
CCP4STATH    equ 0x9CA
_CCP4STATH    equ 0x9CA
_CCP4STATHbits equ 0x9CA
CCP4TMRL     equ 0x9CC
_CCP4TMRL     equ 0x9CC
CCP4TMRH     equ 0x9CE
_CCP4TMRH     equ 0x9CE
CCP4PRL      equ 0x9D0
_CCP4PRL      equ 0x9D0
CCP4PRH      equ 0x9D2
_CCP4PRH      equ 0x9D2
CCP4RA       equ 0x9D4
_CCP4RA       equ 0x9D4
CCP4RAL      equ 0x9D4
_CCP4RAL      equ 0x9D4
CCP4RB       equ 0x9D8
_CCP4RB       equ 0x9D8
CCP4RBL      equ 0x9D8
_CCP4RBL      equ 0x9D8
CCP4BUFL     equ 0x9DC
_CCP4BUFL     equ 0x9DC
CCP4BUFH     equ 0x9DE
_CCP4BUFH     equ 0x9DE
DMACON       equ 0xABC
_DMACON       equ 0xABC
_DMACONbits   equ 0xABC
DMABUF       equ 0xABE
_DMABUF       equ 0xABE
DMAL         equ 0xAC0
_DMAL         equ 0xAC0
DMAH         equ 0xAC2
_DMAH         equ 0xAC2
DMACH0       equ 0xAC4
_DMACH0       equ 0xAC4
_DMACH0bits   equ 0xAC4
DMAINT0      equ 0xAC6
_DMAINT0      equ 0xAC6
_DMAINT0bits  equ 0xAC6
DMASRC0      equ 0xAC8
_DMASRC0      equ 0xAC8
DMADST0      equ 0xACA
_DMADST0      equ 0xACA
DMACNT0      equ 0xACC
_DMACNT0      equ 0xACC
DMACH1       equ 0xACE
_DMACH1       equ 0xACE
_DMACH1bits   equ 0xACE
DMAINT1      equ 0xAD0
_DMAINT1      equ 0xAD0
_DMAINT1bits  equ 0xAD0
DMASRC1      equ 0xAD2
_DMASRC1      equ 0xAD2
DMADST1      equ 0xAD4
_DMADST1      equ 0xAD4
DMACNT1      equ 0xAD6
_DMACNT1      equ 0xAD6
DMACH2       equ 0xAD8
_DMACH2       equ 0xAD8
_DMACH2bits   equ 0xAD8
DMAINT2      equ 0xADA
_DMAINT2      equ 0xADA
_DMAINT2bits  equ 0xADA
DMASRC2      equ 0xADC
_DMASRC2      equ 0xADC
DMADST2      equ 0xADE
_DMADST2      equ 0xADE
DMACNT2      equ 0xAE0
_DMACNT2      equ 0xAE0
DMACH3       equ 0xAE2
_DMACH3       equ 0xAE2
_DMACH3bits   equ 0xAE2
DMAINT3      equ 0xAE4
_DMAINT3      equ 0xAE4
_DMAINT3bits  equ 0xAE4
DMASRC3      equ 0xAE6
_DMASRC3      equ 0xAE6
DMADST3      equ 0xAE8
_DMADST3      equ 0xAE8
DMACNT3      equ 0xAEA
_DMACNT3      equ 0xAEA
ADCON1L      equ 0xB00
_ADCON1L      equ 0xB00
_ADCON1Lbits  equ 0xB00
ADCON1H      equ 0xB02
_ADCON1H      equ 0xB02
_ADCON1Hbits  equ 0xB02
ADCON2L      equ 0xB04
_ADCON2L      equ 0xB04
_ADCON2Lbits  equ 0xB04
ADCON2H      equ 0xB06
_ADCON2H      equ 0xB06
_ADCON2Hbits  equ 0xB06
ADCON3L      equ 0xB08
_ADCON3L      equ 0xB08
_ADCON3Lbits  equ 0xB08
ADCON3H      equ 0xB0A
_ADCON3H      equ 0xB0A
_ADCON3Hbits  equ 0xB0A
ADMOD0L      equ 0xB10
_ADMOD0L      equ 0xB10
_ADMOD0Lbits  equ 0xB10
ADMOD0H      equ 0xB12
_ADMOD0H      equ 0xB12
_ADMOD0Hbits  equ 0xB12
ADMOD1L      equ 0xB14
_ADMOD1L      equ 0xB14
_ADMOD1Lbits  equ 0xB14
ADIEL        equ 0xB20
_ADIEL        equ 0xB20
_ADIELbits    equ 0xB20
ADIEH        equ 0xB22
_ADIEH        equ 0xB22
_ADIEHbits    equ 0xB22
ADCSSL       equ 0xB28
_ADCSSL       equ 0xB28
_ADCSSLbits   equ 0xB28
ADCSSH       equ 0xB2A
_ADCSSH       equ 0xB2A
_ADCSSHbits   equ 0xB2A
ADSTATL      equ 0xB30
_ADSTATL      equ 0xB30
_ADSTATLbits  equ 0xB30
ADSTATH      equ 0xB32
_ADSTATH      equ 0xB32
_ADSTATHbits  equ 0xB32
ADCMP0ENL    equ 0xB38
_ADCMP0ENL    equ 0xB38
_ADCMP0ENLbits equ 0xB38
ADCMP0ENH    equ 0xB3A
_ADCMP0ENH    equ 0xB3A
_ADCMP0ENHbits equ 0xB3A
ADCMP0LO     equ 0xB3C
_ADCMP0LO     equ 0xB3C
ADCMP0HI     equ 0xB3E
_ADCMP0HI     equ 0xB3E
ADCMP1ENL    equ 0xB40
_ADCMP1ENL    equ 0xB40
_ADCMP1ENLbits equ 0xB40
ADCMP1ENH    equ 0xB42
_ADCMP1ENH    equ 0xB42
_ADCMP1ENHbits equ 0xB42
ADCMP1LO     equ 0xB44
_ADCMP1LO     equ 0xB44
ADCMP1HI     equ 0xB46
_ADCMP1HI     equ 0xB46
ADCMP2ENL    equ 0xB48
_ADCMP2ENL    equ 0xB48
_ADCMP2ENLbits equ 0xB48
ADCMP2ENH    equ 0xB4A
_ADCMP2ENH    equ 0xB4A
_ADCMP2ENHbits equ 0xB4A
ADCMP2LO     equ 0xB4C
_ADCMP2LO     equ 0xB4C
ADCMP2HI     equ 0xB4E
_ADCMP2HI     equ 0xB4E
ADCMP3ENL    equ 0xB50
_ADCMP3ENL    equ 0xB50
_ADCMP3ENLbits equ 0xB50
ADCMP3ENH    equ 0xB52
_ADCMP3ENH    equ 0xB52
_ADCMP3ENHbits equ 0xB52
ADCMP3LO     equ 0xB54
_ADCMP3LO     equ 0xB54
ADCMP3HI     equ 0xB56
_ADCMP3HI     equ 0xB56
ADFL0DAT     equ 0xB68
_ADFL0DAT     equ 0xB68
ADFL0CON     equ 0xB6A
_ADFL0CON     equ 0xB6A
_ADFL0CONbits equ 0xB6A
ADFL1DAT     equ 0xB6C
_ADFL1DAT     equ 0xB6C
ADFL1CON     equ 0xB6E
_ADFL1CON     equ 0xB6E
_ADFL1CONbits equ 0xB6E
ADFL2DAT     equ 0xB70
_ADFL2DAT     equ 0xB70
ADFL2CON     equ 0xB72
_ADFL2CON     equ 0xB72
_ADFL2CONbits equ 0xB72
ADFL3DAT     equ 0xB74
_ADFL3DAT     equ 0xB74
ADFL3CON     equ 0xB76
_ADFL3CON     equ 0xB76
_ADFL3CONbits equ 0xB76
ADTRIG0L     equ 0xB80
_ADTRIG0L     equ 0xB80
_ADTRIG0Lbits equ 0xB80
ADTRIG0H     equ 0xB82
_ADTRIG0H     equ 0xB82
_ADTRIG0Hbits equ 0xB82
ADTRIG1L     equ 0xB84
_ADTRIG1L     equ 0xB84
_ADTRIG1Lbits equ 0xB84
ADTRIG1H     equ 0xB86
_ADTRIG1H     equ 0xB86
_ADTRIG1Hbits equ 0xB86
ADTRIG2L     equ 0xB88
_ADTRIG2L     equ 0xB88
_ADTRIG2Lbits equ 0xB88
ADTRIG2H     equ 0xB8A
_ADTRIG2H     equ 0xB8A
_ADTRIG2Hbits equ 0xB8A
ADTRIG3L     equ 0xB8C
_ADTRIG3L     equ 0xB8C
_ADTRIG3Lbits equ 0xB8C
ADTRIG3H     equ 0xB8E
_ADTRIG3H     equ 0xB8E
_ADTRIG3Hbits equ 0xB8E
ADTRIG4L     equ 0xB90
_ADTRIG4L     equ 0xB90
_ADTRIG4Lbits equ 0xB90
ADCMP0CON    equ 0xBA0
_ADCMP0CON    equ 0xBA0
_ADCMP0CONbits equ 0xBA0
ADCMP1CON    equ 0xBA4
_ADCMP1CON    equ 0xBA4
_ADCMP1CONbits equ 0xBA4
ADCMP2CON    equ 0xBA8
_ADCMP2CON    equ 0xBA8
_ADCMP2CONbits equ 0xBA8
ADCMP3CON    equ 0xBAC
_ADCMP3CON    equ 0xBAC
_ADCMP3CONbits equ 0xBAC
ADLVLTRGL    equ 0xBD0
_ADLVLTRGL    equ 0xBD0
_ADLVLTRGLbits equ 0xBD0
ADLVLTRGH    equ 0xBD2
_ADLVLTRGH    equ 0xBD2
_ADLVLTRGHbits equ 0xBD2
ADEIEL       equ 0xBF0
_ADEIEL       equ 0xBF0
_ADEIELbits   equ 0xBF0
ADEIEH       equ 0xBF2
_ADEIEH       equ 0xBF2
_ADEIEHbits   equ 0xBF2
ADEISTATL    equ 0xBF8
_ADEISTATL    equ 0xBF8
_ADEISTATLbits equ 0xBF8
ADEISTATH    equ 0xBFA
_ADEISTATH    equ 0xBFA
_ADEISTATHbits equ 0xBFA
ADCON5L      equ 0xC00
_ADCON5L      equ 0xC00
_ADCON5Lbits  equ 0xC00
ADCON5H      equ 0xC02
_ADCON5H      equ 0xC02
_ADCON5Hbits  equ 0xC02
ADCBUF0      equ 0xC0C
_ADCBUF0      equ 0xC0C
ADCBUF1      equ 0xC0E
_ADCBUF1      equ 0xC0E
ADCBUF2      equ 0xC10
_ADCBUF2      equ 0xC10
ADCBUF3      equ 0xC12
_ADCBUF3      equ 0xC12
ADCBUF4      equ 0xC14
_ADCBUF4      equ 0xC14
ADCBUF5      equ 0xC16
_ADCBUF5      equ 0xC16
ADCBUF6      equ 0xC18
_ADCBUF6      equ 0xC18
ADCBUF7      equ 0xC1A
_ADCBUF7      equ 0xC1A
ADCBUF8      equ 0xC1C
_ADCBUF8      equ 0xC1C
ADCBUF9      equ 0xC1E
_ADCBUF9      equ 0xC1E
ADCBUF10     equ 0xC20
_ADCBUF10     equ 0xC20
ADCBUF11     equ 0xC22
_ADCBUF11     equ 0xC22
ADCBUF12     equ 0xC24
_ADCBUF12     equ 0xC24
ADCBUF13     equ 0xC26
_ADCBUF13     equ 0xC26
ADCBUF14     equ 0xC28
_ADCBUF14     equ 0xC28
ADCBUF15     equ 0xC2A
_ADCBUF15     equ 0xC2A
ADCBUF16     equ 0xC2C
_ADCBUF16     equ 0xC2C
ADCBUF17     equ 0xC2E
_ADCBUF17     equ 0xC2E
DACCTRL1L    equ 0xC80
_DACCTRL1L    equ 0xC80
_DACCTRL1Lbits equ 0xC80
DACCTRL2L    equ 0xC84
_DACCTRL2L    equ 0xC84
_DACCTRL2Lbits equ 0xC84
DACCTRL2H    equ 0xC86
_DACCTRL2H    equ 0xC86
_DACCTRL2Hbits equ 0xC86
DAC1CONL     equ 0xC88
_DAC1CONL     equ 0xC88
_DAC1CONLbits equ 0xC88
DAC1CONH     equ 0xC8A
_DAC1CONH     equ 0xC8A
_DAC1CONHbits equ 0xC8A
DAC1DATL     equ 0xC8C
_DAC1DATL     equ 0xC8C
_DAC1DATLbits equ 0xC8C
DAC1DATH     equ 0xC8E
_DAC1DATH     equ 0xC8E
_DAC1DATHbits equ 0xC8E
SLP1CONL     equ 0xC90
_SLP1CONL     equ 0xC90
_SLP1CONLbits equ 0xC90
SLP1CONH     equ 0xC92
_SLP1CONH     equ 0xC92
_SLP1CONHbits equ 0xC92
SLP1DAT      equ 0xC94
_SLP1DAT      equ 0xC94
_SLP1DATbits  equ 0xC94
VREGCON      equ 0xCFC
_VREGCON      equ 0xCFC
_VREGCONbits  equ 0xCFC
RPCON        equ 0xD00
_RPCON        equ 0xD00
_RPCONbits    equ 0xD00
RPINR0       equ 0xD04
_RPINR0       equ 0xD04
_RPINR0bits   equ 0xD04
RPINR1       equ 0xD06
_RPINR1       equ 0xD06
_RPINR1bits   equ 0xD06
RPINR2       equ 0xD08
_RPINR2       equ 0xD08
_RPINR2bits   equ 0xD08
RPINR3       equ 0xD0A
_RPINR3       equ 0xD0A
_RPINR3bits   equ 0xD0A
RPINR4       equ 0xD0C
_RPINR4       equ 0xD0C
_RPINR4bits   equ 0xD0C
RPINR5       equ 0xD0E
_RPINR5       equ 0xD0E
_RPINR5bits   equ 0xD0E
RPINR6       equ 0xD10
_RPINR6       equ 0xD10
_RPINR6bits   equ 0xD10
RPINR11      equ 0xD1A
_RPINR11      equ 0xD1A
_RPINR11bits  equ 0xD1A
RPINR12      equ 0xD1C
_RPINR12      equ 0xD1C
_RPINR12bits  equ 0xD1C
RPINR13      equ 0xD1E
_RPINR13      equ 0xD1E
_RPINR13bits  equ 0xD1E
RPINR14      equ 0xD20
_RPINR14      equ 0xD20
_RPINR14bits  equ 0xD20
RPINR15      equ 0xD22
_RPINR15      equ 0xD22
_RPINR15bits  equ 0xD22
RPINR18      equ 0xD28
_RPINR18      equ 0xD28
_RPINR18bits  equ 0xD28
RPINR19      equ 0xD2A
_RPINR19      equ 0xD2A
_RPINR19bits  equ 0xD2A
RPINR20      equ 0xD2C
_RPINR20      equ 0xD2C
_RPINR20bits  equ 0xD2C
RPINR21      equ 0xD2E
_RPINR21      equ 0xD2E
_RPINR21bits  equ 0xD2E
RPINR22      equ 0xD30
_RPINR22      equ 0xD30
_RPINR22bits  equ 0xD30
RPINR23      equ 0xD32
_RPINR23      equ 0xD32
_RPINR23bits  equ 0xD32
RPINR27      equ 0xD3A
_RPINR27      equ 0xD3A
_RPINR27bits  equ 0xD3A
RPINR37      equ 0xD4E
_RPINR37      equ 0xD4E
_RPINR37bits  equ 0xD4E
RPINR38      equ 0xD50
_RPINR38      equ 0xD50
_RPINR38bits  equ 0xD50
RPINR42      equ 0xD58
_RPINR42      equ 0xD58
_RPINR42bits  equ 0xD58
RPINR43      equ 0xD5A
_RPINR43      equ 0xD5A
_RPINR43bits  equ 0xD5A
RPINR44      equ 0xD5C
_RPINR44      equ 0xD5C
_RPINR44bits  equ 0xD5C
RPINR45      equ 0xD5E
_RPINR45      equ 0xD5E
_RPINR45bits  equ 0xD5E
RPINR46      equ 0xD60
_RPINR46      equ 0xD60
_RPINR46bits  equ 0xD60
RPINR47      equ 0xD62
_RPINR47      equ 0xD62
_RPINR47bits  equ 0xD62
RPINR48      equ 0xD64
_RPINR48      equ 0xD64
_RPINR48bits  equ 0xD64
RPINR49      equ 0xD66
_RPINR49      equ 0xD66
_RPINR49bits  equ 0xD66
RPOR0        equ 0xD80
_RPOR0        equ 0xD80
_RPOR0bits    equ 0xD80
RPOR1        equ 0xD82
_RPOR1        equ 0xD82
_RPOR1bits    equ 0xD82
RPOR2        equ 0xD84
_RPOR2        equ 0xD84
_RPOR2bits    equ 0xD84
RPOR3        equ 0xD86
_RPOR3        equ 0xD86
_RPOR3bits    equ 0xD86
RPOR4        equ 0xD88
_RPOR4        equ 0xD88
_RPOR4bits    equ 0xD88
RPOR5        equ 0xD8A
_RPOR5        equ 0xD8A
_RPOR5bits    equ 0xD8A
RPOR6        equ 0xD8C
_RPOR6        equ 0xD8C
_RPOR6bits    equ 0xD8C
RPOR7        equ 0xD8E
_RPOR7        equ 0xD8E
_RPOR7bits    equ 0xD8E
RPOR8        equ 0xD90
_RPOR8        equ 0xD90
_RPOR8bits    equ 0xD90
RPOR9        equ 0xD92
_RPOR9        equ 0xD92
_RPOR9bits    equ 0xD92
RPOR10       equ 0xD94
_RPOR10       equ 0xD94
_RPOR10bits   equ 0xD94
RPOR11       equ 0xD96
_RPOR11       equ 0xD96
_RPOR11bits   equ 0xD96
RPOR12       equ 0xD98
_RPOR12       equ 0xD98
_RPOR12bits   equ 0xD98
RPOR13       equ 0xD9A
_RPOR13       equ 0xD9A
_RPOR13bits   equ 0xD9A
RPOR14       equ 0xD9C
_RPOR14       equ 0xD9C
_RPOR14bits   equ 0xD9C
RPOR15       equ 0xD9E
_RPOR15       equ 0xD9E
_RPOR15bits   equ 0xD9E
RPOR16       equ 0xDA0
_RPOR16       equ 0xDA0
_RPOR16bits   equ 0xDA0
RPOR17       equ 0xDA2
_RPOR17       equ 0xDA2
_RPOR17bits   equ 0xDA2
RPOR18       equ 0xDA4
_RPOR18       equ 0xDA4
_RPOR18bits   equ 0xDA4
RPOR19       equ 0xDA6
_RPOR19       equ 0xDA6
_RPOR19bits   equ 0xDA6
ANSELA       equ 0xE00
_ANSELA       equ 0xE00
_ANSELAbits   equ 0xE00
TRISA        equ 0xE02
_TRISA        equ 0xE02
_TRISAbits    equ 0xE02
PORTA        equ 0xE04
_PORTA        equ 0xE04
_PORTAbits    equ 0xE04
LATA         equ 0xE06
_LATA         equ 0xE06
_LATAbits     equ 0xE06
ODCA         equ 0xE08
_ODCA         equ 0xE08
_ODCAbits     equ 0xE08
CNPUA        equ 0xE0A
_CNPUA        equ 0xE0A
_CNPUAbits    equ 0xE0A
CNPDA        equ 0xE0C
_CNPDA        equ 0xE0C
_CNPDAbits    equ 0xE0C
CNCONA       equ 0xE0E
_CNCONA       equ 0xE0E
_CNCONAbits   equ 0xE0E
CNEN0A       equ 0xE10
_CNEN0A       equ 0xE10
_CNEN0Abits   equ 0xE10
CNSTATA      equ 0xE12
_CNSTATA      equ 0xE12
_CNSTATAbits  equ 0xE12
CNEN1A       equ 0xE14
_CNEN1A       equ 0xE14
_CNEN1Abits   equ 0xE14
CNFA         equ 0xE16
_CNFA         equ 0xE16
_CNFAbits     equ 0xE16
ANSELB       equ 0xE1C
_ANSELB       equ 0xE1C
_ANSELBbits   equ 0xE1C
TRISB        equ 0xE1E
_TRISB        equ 0xE1E
_TRISBbits    equ 0xE1E
PORTB        equ 0xE20
_PORTB        equ 0xE20
_PORTBbits    equ 0xE20
LATB         equ 0xE22
_LATB         equ 0xE22
_LATBbits     equ 0xE22
ODCB         equ 0xE24
_ODCB         equ 0xE24
_ODCBbits     equ 0xE24
CNPUB        equ 0xE26
_CNPUB        equ 0xE26
_CNPUBbits    equ 0xE26
CNPDB        equ 0xE28
_CNPDB        equ 0xE28
_CNPDBbits    equ 0xE28
CNCONB       equ 0xE2A
_CNCONB       equ 0xE2A
_CNCONBbits   equ 0xE2A
CNEN0B       equ 0xE2C
_CNEN0B       equ 0xE2C
_CNEN0Bbits   equ 0xE2C
CNSTATB      equ 0xE2E
_CNSTATB      equ 0xE2E
_CNSTATBbits  equ 0xE2E
CNEN1B       equ 0xE30
_CNEN1B       equ 0xE30
_CNEN1Bbits   equ 0xE30
CNFB         equ 0xE32
_CNFB         equ 0xE32
_CNFBbits     equ 0xE32
ANSELC       equ 0xE38
_ANSELC       equ 0xE38
_ANSELCbits   equ 0xE38
TRISC        equ 0xE3A
_TRISC        equ 0xE3A
_TRISCbits    equ 0xE3A
PORTC        equ 0xE3C
_PORTC        equ 0xE3C
_PORTCbits    equ 0xE3C
LATC         equ 0xE3E
_LATC         equ 0xE3E
_LATCbits     equ 0xE3E
ODCC         equ 0xE40
_ODCC         equ 0xE40
_ODCCbits     equ 0xE40
CNPUC        equ 0xE42
_CNPUC        equ 0xE42
_CNPUCbits    equ 0xE42
CNPDC        equ 0xE44
_CNPDC        equ 0xE44
_CNPDCbits    equ 0xE44
CNCONC       equ 0xE46
_CNCONC       equ 0xE46
_CNCONCbits   equ 0xE46
CNEN0C       equ 0xE48
_CNEN0C       equ 0xE48
_CNEN0Cbits   equ 0xE48
CNSTATC      equ 0xE4A
_CNSTATC      equ 0xE4A
_CNSTATCbits  equ 0xE4A
CNEN1C       equ 0xE4C
_CNEN1C       equ 0xE4C
_CNEN1Cbits   equ 0xE4C
CNFC         equ 0xE4E
_CNFC         equ 0xE4E
_CNFCbits     equ 0xE4E
ANSELD       equ 0xE54
_ANSELD       equ 0xE54
_ANSELDbits   equ 0xE54
TRISD        equ 0xE56
_TRISD        equ 0xE56
_TRISDbits    equ 0xE56
PORTD        equ 0xE58
_PORTD        equ 0xE58
_PORTDbits    equ 0xE58
LATD         equ 0xE5A
_LATD         equ 0xE5A
_LATDbits     equ 0xE5A
ODCD         equ 0xE5C
_ODCD         equ 0xE5C
_ODCDbits     equ 0xE5C
CNPUD        equ 0xE5E
_CNPUD        equ 0xE5E
_CNPUDbits    equ 0xE5E
CNPDD        equ 0xE60
_CNPDD        equ 0xE60
_CNPDDbits    equ 0xE60
CNCOND       equ 0xE62
_CNCOND       equ 0xE62
_CNCONDbits   equ 0xE62
CNEN0D       equ 0xE64
_CNEN0D       equ 0xE64
_CNEN0Dbits   equ 0xE64
CNSTATD      equ 0xE66
_CNSTATD      equ 0xE66
_CNSTATDbits  equ 0xE66
CNEN1D       equ 0xE68
_CNEN1D       equ 0xE68
_CNEN1Dbits   equ 0xE68
CNFD         equ 0xE6A
_CNFD         equ 0xE6A
_CNFDbits     equ 0xE6A
MBISTCON     equ 0xEFC
_MBISTCON     equ 0xEFC
_MBISTCONbits equ 0xEFC
U3MODE       equ 0xF00
_U3MODE       equ 0xF00
_U3MODEbits   equ 0xF00
U3MODEH      equ 0xF02
_U3MODEH      equ 0xF02
_U3MODEHbits  equ 0xF02
U3STA        equ 0xF04
_U3STA        equ 0xF04
_U3STAbits    equ 0xF04
U3STAH       equ 0xF06
_U3STAH       equ 0xF06
_U3STAHbits   equ 0xF06
U3BRG        equ 0xF08
_U3BRG        equ 0xF08
_U3BRGbits    equ 0xF08
U3BRGH       equ 0xF0A
_U3BRGH       equ 0xF0A
_U3BRGHbits   equ 0xF0A
U3RXREG      equ 0xF0C
_U3RXREG      equ 0xF0C
_U3RXREGbits  equ 0xF0C
U3TXREG      equ 0xF10
_U3TXREG      equ 0xF10
_U3TXREGbits  equ 0xF10
U3P1         equ 0xF14
_U3P1         equ 0xF14
_U3P1bits     equ 0xF14
U3P2         equ 0xF16
_U3P2         equ 0xF16
_U3P2bits     equ 0xF16
U3P3         equ 0xF18
_U3P3         equ 0xF18
_U3P3bits     equ 0xF18
U3P3H        equ 0xF1A
_U3P3H        equ 0xF1A
_U3P3Hbits    equ 0xF1A
U3TXCHK      equ 0xF1C
_U3TXCHK      equ 0xF1C
_U3TXCHKbits  equ 0xF1C
U3RXCHK      equ 0xF1E
