mikeakohn/naken_asm/include/dspic/p33ck64mc105.inc
_U3RXCHK      equ 0xF1E
_U3RXCHKbits  equ 0xF1E
U3SCCON      equ 0xF20
_U3SCCON      equ 0xF20
_U3SCCONbits  equ 0xF20
U3SCINT      equ 0xF22
_U3SCINT      equ 0xF22
_U3SCINTbits  equ 0xF22
U3INT        equ 0xF24
_U3INT        equ 0xF24
_U3INTbits    equ 0xF24
RCON         equ 0xF80
_RCON         equ 0xF80
_RCONbits     equ 0xF80
OSCCON       equ 0xF84
_OSCCON       equ 0xF84
_OSCCONbits   equ 0xF84
OSCCONL      equ 0xF84
_OSCCONL      equ 0xF84
OSCCONH      equ 0xF85
_OSCCONH      equ 0xF85
CLKDIV       equ 0xF86
_CLKDIV       equ 0xF86
_CLKDIVbits   equ 0xF86
PLLFBD       equ 0xF88
_PLLFBD       equ 0xF88
_PLLFBDbits   equ 0xF88
PLLDIV       equ 0xF8A
_PLLDIV       equ 0xF8A
_PLLDIVbits   equ 0xF8A
OSCTUN       equ 0xF8C
_OSCTUN       equ 0xF8C
_OSCTUNbits   equ 0xF8C
DCOTUN       equ 0xF9C
_DCOTUN       equ 0xF9C
_DCOTUNbits   equ 0xF9C
DCOCON       equ 0xF9E
_DCOCON       equ 0xF9E
_DCOCONbits   equ 0xF9E
PMDCON       equ 0xFA0
_PMDCON       equ 0xFA0
_PMDCONbits   equ 0xFA0
PMD1         equ 0xFA4
_PMD1         equ 0xFA4
_PMD1bits     equ 0xFA4
PMD2         equ 0xFA6
_PMD2         equ 0xFA6
_PMD2bits     equ 0xFA6
PMD3         equ 0xFA8
_PMD3         equ 0xFA8
_PMD3bits     equ 0xFA8
PMD4         equ 0xFAA
_PMD4         equ 0xFAA
_PMD4bits     equ 0xFAA
PMD6         equ 0xFAE
_PMD6         equ 0xFAE
_PMD6bits     equ 0xFAE
PMD7         equ 0xFB0
_PMD7         equ 0xFB0
_PMD7bits     equ 0xFB0
PMD8         equ 0xFB2
_PMD8         equ 0xFB2
_PMD8bits     equ 0xFB2
WDTCONL      equ 0xFB4
_WDTCONL      equ 0xFB4
_WDTCONLbits  equ 0xFB4
WDTCONH      equ 0xFB6
_WDTCONH      equ 0xFB6
REFOCON1     equ 0xFB8
_REFOCON1     equ 0xFB8
_REFOCON1bits equ 0xFB8
REFOCONL     equ 0xFB8
_REFOCONL     equ 0xFB8
_REFOCONLbits equ 0xFB8
REFOCON2     equ 0xFBA
_REFOCON2     equ 0xFBA
_REFOCON2bits equ 0xFBA
REFOCONH     equ 0xFBA
_REFOCONH     equ 0xFBA
_REFOCONHbits equ 0xFBA
REFOTRIMH    equ 0xFBE
_REFOTRIMH    equ 0xFBE
_REFOTRIMHbits equ 0xFBE
PCTRAPL      equ 0xFC0
_PCTRAPL      equ 0xFC0
PCTRAPH      equ 0xFC2
_PCTRAPH      equ 0xFC2
_PCTRAPHbits  equ 0xFC2
FEXL         equ 0xFC4
_FEXL         equ 0xFC4
FEXH         equ 0xFC6
_FEXH         equ 0xFC6
_FEXHbits     equ 0xFC6
FEXU         equ 0xFC6
_FEXU         equ 0xFC6
_FEXUbits     equ 0xFC6
FEX2L        equ 0xFC8
_FEX2L        equ 0xFC8
FEX2H        equ 0xFCA
_FEX2H        equ 0xFCA
_FEX2Hbits    equ 0xFCA
FEX2U        equ 0xFCA
_FEX2U        equ 0xFCA
_FEX2Ubits    equ 0xFCA
VISI         equ 0xFCC
_VISI         equ 0xFCC
DPCL         equ 0xFCE
_DPCL         equ 0xFCE
DPCH         equ 0xFD0
_DPCH         equ 0xFD0
_DPCHbits     equ 0xFD0
APPO         equ 0xFD2
_APPO         equ 0xFD2
APPI         equ 0xFD4
_APPI         equ 0xFD4
APPS         equ 0xFD6
_APPS         equ 0xFD6
_APPSbits     equ 0xFD6
STROUTL      equ 0xFD8
_STROUTL      equ 0xFD8
STROUTH      equ 0xFDA
_STROUTH      equ 0xFDA
STROVCNT     equ 0xFDC
_STROVCNT     equ 0xFDC
JDATAL       equ 0xFFA
_JDATAL       equ 0xFFA
JDATAH       equ 0xFFC
_JDATAH       equ 0xFFC
ACCA         equ 0x22
_ACCA         equ 0x22
ACCB         equ 0x28
_ACCB         equ 0x28
UART1        equ 0x238
_UART1        equ 0x238
UART2        equ 0x260
_UART2        equ 0x260
UART3        equ 0xF00
_UART3        equ 0xF00

;; These aren't generated yet.
UARTEN equ 15
UTXEN  equ 5
URXEN  equ 4

UTXBE  equ 5
UTXBF  equ 4
URXBE  equ 1
URXBF  equ 0

